from DR_common2 import posj, posx

# 1. 전역 기본 좌표
POS_HOME = posj(0, 0, 90, 0, 90, 0)

# 그릇 잡는 위치 및 상단 웨이포인트
POS_PICK_BOWL = posj(2.045, 29.011, 82.338, 0.171, 96.685, 3.254)
POS_PICK_UP = posx(378.928, 0.177, 223.254, 12.306, -155.026, 20.238)

# 볼 수세미 위치 및 세척 위치
POS_BALL = posj(-72.170, -9.703, 128.614, -0.669, 61.503, -67.838)
POS_BALL_RUB = posj(1.164, -1.451, 117.530, 0.125, 63.917, 1.225)

# 수세미 문지르는 위치
POS_SPONGE = posj(17.577, -10.794, 125.037, -29.068, 28.223, -138.449)

# 수세미 문지르기(scrub_bowl_on_sponge) 함수 내부 원호 정의용 하드코딩 좌표
POS_SPONGE_POS1 = posj(9.755, 4.083, 108.920, -35.669, 25.717, -133.529)
POS_SPONGE_POS2 = posj(20.343, 6.085, 105.300, -36.649, 31.573, -131.235)

# 원호 세척 후 나선 세척 접근 위치 및 중심 위치 (DR_BASE 기준 TCP)
POS_SPIRAL_APPROACH = posx(464.123, 61.392, 254.025, 175.211, -137.516, -1.195)
POS_SPIRAL_CENTER = posx(560.208, 87.876, 236.756, 177.438, -136.533, -0.652)

# 거치대 접근 위치 및 하드코딩 경유 위치
POS_RACK = posj(-23.000, 60.827, 47.300, 86.601, 85.393, -128.989)
POS_RACK_VIA = posx(633.731, -144.097, 410.715, 146.904, -126.235, -29.288)
POS_RACK_WP = posx(756.834, 109.067, 290.518, 176.482, -144.419, -7.182)
POS_RACK_VIA2 = posj(-22.985, 56.168, 29.953, 85.111, 86.983, -106.963)

# 세척 후 웨이포인트
POS_WAY = posx(622.800, -51.316, 322.614, 10.299, 149.650, -112.982)
